Enums/Renault_ВидыОперацийДолгосрочногоХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ВидыОперацийДолгосрочногоХранения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДавлениеВШинах</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АккумуляторнаяБатарея</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МойкаКузова</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаВентиляции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Двигатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТяговаяБатарея</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_ВидыОперацийДолгосрочногоХранения/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("VIN") Тогда
		СтандартнаяОбработка = Ложь;
		
	    ВидыОпераций = ПолучитьВидыОпераций(?(ЭтоЭлектромобиль(Параметры.Отбор.VIN),"Электромобиль","ДВС"));
		Если Не ПустаяСтрока(Параметры.СтрокаПоиска) Тогда
			Мс = Новый Массив;
			Для каждого Эл Из ВидыОпераций Цикл
				Если СтрЧислоВхождений(НРег(Строка(Эл)),НРег(Параметры.СтрокаПоиска))=0 Тогда Мс.Добавить(Эл); КонецЕсли;
			КонецЦикла;	
			
			Для каждого Эл Из Мс Цикл
				ВидыОпераций.Удалить(ВидыОпераций.Найти(Эл));
			КонецЦикла;
			
			ДанныеВыбора = Новый СписокЗначений;
			ДанныеВыбора.ЗагрузитьЗначения(ВидыОпераций);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция Подробности(Ссылка) Экспорт
	
	Вз = Новый Массив;
	
	//Если Ссылка=ДавлениеВШинах Тогда  Вз.Добавить("Подкачка давления до 3х БАР (3,04 Атмосфер)");
	//ИначеЕсли Ссылка=МойкаКузова Тогда  Вз.Добавить("Мойка Кузова без протирания, При необходимости использовать  IXTAR (7711228950).");	
	//ИначеЕсли Ссылка=Топливо Тогда  Вз.Добавить("Долить 2Л");	
	//ИначеЕсли Ссылка=СистемаВентиляции Тогда  Вз.Добавить("1 мин работы системы вентиляции и кондиционирования на полной мощности вентилятора");
	//ИначеЕсли Ссылка=Двигатель Тогда  Вз.Добавить("Проехать 500 метров");
	//ИначеЕсли Ссылка=ТяговаяБатарея Тогда Вз.Добавить("Проверка (При необходимости зарядка)");	
	//ИначеЕсли Ссылка=АккумуляторнаяБатарея Тогда
	//	Вз.Добавить("Заряжать в течении 6 часов (ATEQ)");	
	//    Вз.Добавить("Проверка о необходимости замены АКБ");	
	//КонецЕсли;
	
	Если Ссылка=ДавлениеВШинах Тогда  Вз.Добавить("Подкачка давления до 3х БАР (2,96 ст. атмосферы)");
	ИначеЕсли Ссылка=СистемаВентиляции Тогда  Вз.Добавить("Запуск двигателя, 1 мин работы системы вентиляции и кондиционирования на максимальной мощности и минимальной температуре");
	ИначеЕсли Ссылка=ТяговаяБатарея Тогда Вз.Добавить("Проверка (При необходимости зарядка)");
	ИначеЕсли Ссылка=АккумуляторнаяБатарея Тогда
		Вз.Добавить("Заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)");
		//Вз.Добавить("Замена Аккумуляторной батареи 12V");
	КонецЕсли;
	
	Возврат ?(Вз.Количество()=0,Неопределено,Вз);

КонецФункции

Функция ПолучитьВидыОпераций(ТипАвтомобиля="", VIN="") Экспорт
	
	Если ПустаяСтрока(ТипАвтомобиля) Тогда
		ТипАвтомобиля = ?(ЭтоЭлектромобиль(VIN),"Электромобиль","ДВС");
	КонецЕсли;
	
	Вз = Новый Массив;
	Вз.Добавить(ДавлениеВШинах);
	//Вз.Добавить(МойкаКузова);
	//Вз.Добавить(Двигатель);
	
	Если ТипАвтомобиля = "Электромобиль" Тогда
		Вз.Добавить(ТяговаяБатарея);
	Иначе	
		//Вз.Добавить(Топливо);
		Вз.Добавить(АккумуляторнаяБатарея);
	КонецЕсли;
	
	Вз.Добавить(СистемаВентиляции);

	Возврат Вз;
	
КонецФункции

Функция ЭтоЭлектромобиль(Знач VIN) Экспорт

	VIN = НРег(СокрЛП(VIN));
	
	Если Лев(VIN,8)=НРег("VF1ACVYB") ИЛИ Лев(VIN,7)=НРег("VF1FW0Z") Тогда Возврат Истина; КонецЕсли;
	
	Возврат Ложь;	

КонецФункции

Функция МесяцыПроверок(ВидОперации, Подробности="") Экспорт

	Мс = Новый Массив;
	
	Если ВидОперации = ДавлениеВШинах Тогда
		Мс.Добавить(6); Мс.Добавить(12);
	//ИначеЕсли ВидОперации = АккумуляторнаяБатарея И Подробности = "Заряжать в течении 6 часов (ATEQ)" Тогда	
	ИначеЕсли ВидОперации = АккумуляторнаяБатарея И Подробности = "Заряжать ATEQ до полной зарядки (зеленый индикатор горит постоянно, не мигает)" Тогда		
		Мс.Добавить(3); Мс.Добавить(6); Мс.Добавить(9);
	//ИначеЕсли ВидОперации = АккумуляторнаяБатарея И Подробности = "Проверка о необходимости замены АКБ" Тогда	
	//	Мс.Добавить(12);	
	//ИначеЕсли ВидОперации = Топливо Тогда
	//	Мс.Добавить(3);
	//ИначеЕсли ВидОперации = МойкаКузова ИЛИ	ВидОперации = ТяговаяБатарея ИЛИ ВидОперации = СистемаВентиляции ИЛИ ВидОперации = Двигатель Тогда
	ИначеЕсли ВидОперации = ТяговаяБатарея ИЛИ ВидОперации = СистемаВентиляции Тогда
		Мс.Добавить(3); Мс.Добавить(6); Мс.Добавить(9); Мс.Добавить(12);
	КонецЕсли;	
	
	Возврат Мс;

КонецФункции
